const relevantTerms = [
  "covid",
  "IT отрасль",
  "IKEA",
  "chess",
  "OBI",
  "v",
  "z",
  "азов",
  "апте",
  "арме",
  "арми",
  "Бессмертный полк",
  "байд",
  "банк",
  "баталь",
  "валют",
  "воен",
  "воин",
  "войн",
  "войнасфейками.рф",
  "глав",
  "граждан",
  "греч",
  "губерн",
  "днр",
  "долг",
  "доллар",
  "донба",
  "евро",
  "займ",
  "зеленск",
  "импорт",
  "из-за ухода",
  "киев",
  "корон",
  "кредит",
  "лекарств",
  "либерал",
  "лнр",
  "МыРаботаем",
  "магаз",
  "мигра",
  "моск",
  "мызaмир",
  "налог",
  "наци",
  "Нет комплектующих",
  "объясняем.рф",
  "памят",
  "пандеми",
  "побед",
  "погиб",
  "патриот",
  "плен",
  "правитель",
  "презид",
  "продукт",
  "путин",
  "росси",
  "рубл",
  "рынок",
  "Роскомнадзор",
  "Соловь",
  "санкц",
  "сахар",
  "своихнебросаем",
  "спецоперац",
  "ссср",
  "супермарк",
  "справедлив",
  "сша",
  "скором возвращении",
  "украин",
  "фашист",
  "фейк",
  "Цен",
  "цен",
  "эваку",
  "экономи",
  "экспорт",
];

/**
 * @todo Improve language matching and make configurable
 */
export const checkIfTextIsRelevant = (text: string): boolean => {
  const textWithoutLinks = text
    .replace(
      /[\w#%+.:=@~-]{1,256}\.[\d()a-z]{1,6}\b([\w\p{L}#%&()+./:=?@~-]*)/giu, // URLs https://stackoverflow.com/a/3809435/1818285 + \p{L}
      "",
    )
    .replace(
      /([\w+.-]+@[\w.-]+\.[\w-]+)/gi, // emails https://stackoverflow.com/a/54340560/1818285
      "",
    )
    .replace(
      /@\w+/g, // @mentions
      "",
    );

  for (const relevantTerm of relevantTerms) {
    if (textWithoutLinks.includes(relevantTerm)) {
      return true;
    }
  }

  return false;
};
